In [2]:
# Persiapan membuat data
import pandas as pd
import random

pelajaran = ['Matematika', 'Fisika', 'Biologi', 'Kimia', 'Geologi', 'Ekonomi']
kelas = ['12A', '12B', '12C', '12D']

hasil_nilai = {
    'siswa_id' : range(1, 21),
    'pelajaran' : [random.choice(pelajaran) for i in range(20)],
    'nilai' : [random.choice(range(0, 100)) for i in range(20)],
    'jenis-kelamin' : [random.choice(['laki-laki', 'perempuan']) for i in range(20)],
    'kelas' : [random.choice(kelas) for i in range(20)]
}

df = pd.DataFrame(hasil_nilai)
df.head()

   siswa_id pelajaran  nilai jenis-kelamin kelas
0         1   Geologi     91     laki-laki   12A
1         2    Fisika     61     perempuan   12B
2         3     Kimia     71     laki-laki   12D
3         4   Geologi      5     perempuan   12D
4         5     Kimia     67     laki-laki   12A

<h2>Soal 1: Indexing</h2>

1. Lakukan indexing terhadap dataframe untuk mengakses column nilai dan kelas saja
2. Lakukan indexing terhadap dataframe untuk mengakses row 5 sampai 10 beserta column pelajaran dan nilai

In [5]:
# code here
df_nilai_kelas = df[{'nilai','kelas'}]
df_nilai_kelas.head()

    nilai   pelajaran
5      69     Geologi
6      68     Geologi
7       7     Ekonomi
8      82     Biologi
9      60     Ekonomi
10     23  Matematika

In [6]:
df_pelj_nilai = df[{'pelajaran','nilai'}]
df_pelj_nilai.iloc[5:11]

    nilai   pelajaran
5      69     Geologi
6      68     Geologi
7       7     Ekonomi
8      82     Biologi
9      60     Ekonomi
10     23  Matematika

<h2>Soal 2: Filter DataFrame Dengan Boolean</h2>

1. Tampilkan semua data siswa pada mata pelajaran Ekonomi dan Fisika
2. Tampilkan semua data siswa yang mempunyai nilai lebih dari 50 di mata pelajaran Kimia 
3. Tampilkan semua data yang mempunyai nilai lebih dari 70, berjnis kelamin perempuan dan di kelas 12C

In [7]:
# code here
fisika = df['pelajaran'] == 'Fisika'
ekonomi = df['pelajaran'] == 'Ekonomi'
df[fisika | ekonomi]

    siswa_id pelajaran  nilai jenis-kelamin kelas
1          2    Fisika     61     perempuan   12B
7          8   Ekonomi      7     laki-laki   12D
9         10   Ekonomi     60     perempuan   12B
12        13   Ekonomi     83     laki-laki   12B
13        14    Fisika     16     laki-laki   12A
15        16    Fisika     66     perempuan   12D
18        19   Ekonomi     32     laki-laki   12B
19        20   Ekonomi     67     perempuan   12C

In [8]:
kimia = df['pelajaran'] == 'Kimia'
nilai50 = df['nilai'] > 50
df[kimia & nilai50]

   siswa_id pelajaran  nilai jenis-kelamin kelas
2         3     Kimia     71     laki-laki   12D
4         5     Kimia     67     laki-laki   12A

In [9]:
perempuan = df['jenis-kelamin'] == 'perempuan'
nilai70 = df['nilai'] > 70
kelas12C = df['kelas'] == '12C'
df[perempuan & nilai70 & kelas12C]

Empty DataFrame
Columns: [siswa_id, pelajaran, nilai, jenis-kelamin, kelas]
Index: []

<h2>Soal 3: Data Transformation</h2>

lakukan data transformasi terhadap column 'nilai' dengan fungsi transformasi, berikut rumus dari normalisasi

![alt text](https://drive.google.com/uc?id=1wed-EbRSTA0JP1ceDp6lcKBqH2yJ4aa3)

In [10]:
# code here
def normalize(x):
    a = x - x.min()
    b = x.max() - x.min()
    return a/b

In [11]:
print(df[['nilai']].apply(normalize))

       nilai
0   1.000000
1   0.651163
2   0.767442
3   0.000000
4   0.720930
5   0.744186
6   0.732558
7   0.023256
8   0.895349
9   0.639535
10  0.209302
11  0.848837
12  0.906977
13  0.127907
14  0.488372
15  0.709302
16  0.848837
17  0.267442
18  0.313953
19  0.720930